---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetalFinishType
source: html/0e2b4cc8-e3f1-4013-a4ea-64527c37eb35.htm
---
# Autodesk.Revit.DB.Visual.MetalFinishType

The enumerated type representing the permitted values for the asset property "MetalFinish" from the "Metal" schema.

## Syntax (C#)
```csharp
public enum MetalFinishType
```